; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v3 - type_3 ?v2 - type_2)
 	      (pred_2 ?v4 - object ?v2 - type_2)
	      (pred_3 ?v3 - type_3 ?v1 - type_1)
	      (pred_4 ?v3 - type_3 ?v4 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v3 - type_3 ?v8 ?v5 - type_2)
       :precondition (and  (pred_1 ?v3 ?v8))
       :effect (and  (pred_1 ?v3 ?v5)
		     (not (pred_1 ?v3 ?v8))))

   (:action op_3
       :parameters (?v3 - type_3 ?v6 - object ?v7 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v7) (pred_1 ?v3 ?v7) (pred_3 ?v3 ?v1))
       :effect (and (pred_4 ?v3 ?v6 ?v1)
		    (not (pred_2 ?v6 ?v7)) 
		    (not (pred_3 ?v3 ?v1))))

   (:action op_2
       :parameters (?v3 - type_3 ?v6 - object ?v7 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v3 ?v6 ?v1) (pred_1 ?v3 ?v7))
       :effect (and (pred_2 ?v6 ?v7)
		    (pred_3 ?v3 ?v1)
		    (not (pred_4 ?v3 ?v6 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_06 - type_3
obj_10 obj_12 obj_13 obj_04 - type_1
obj_11 obj_02 obj_01 obj_08 - type_2
obj_03 obj_09 obj_05 obj_14 - object)
(:init
(pred_1 obj_07 obj_11)
(pred_3 obj_07 obj_10)
(pred_3 obj_07 obj_12)
(pred_1 obj_06 obj_08)
(pred_3 obj_06 obj_13)
(pred_3 obj_06 obj_04)
(pred_2 obj_03 obj_01)
(pred_2 obj_09 obj_01)
(pred_2 obj_05 obj_11)
(pred_2 obj_14 obj_08)
)
(:goal
(and
(pred_2 obj_03 obj_02)
(pred_2 obj_09 obj_08)
(pred_2 obj_05 obj_02)
(pred_2 obj_14 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_07 obj_02) (pred_1 obj_06 obj_02))))
  )
)
)

; plan
1. (op_3 obj_07 obj_05 obj_11 obj_12)
   deleted: (pred_2 obj_05 obj_11) (pred_3 obj_07 obj_12)
   added: (pred_4 obj_07 obj_05 obj_12)
   goals met: 1 of 4
2. (op_1 obj_06 obj_08 obj_01)
   deleted: (pred_1 obj_06 obj_08)
   added: (pred_1 obj_06 obj_01)
   goals met: 1 of 4
3. (op_1 obj_07 obj_11 obj_02)
   deleted: (pred_1 obj_07 obj_11)
   added: (pred_1 obj_07 obj_02)
   goals met: 1 of 4
4. (op_3 obj_06 obj_09 obj_01 obj_04)
   deleted: (pred_2 obj_09 obj_01) (pred_3 obj_06 obj_04)
   added: (pred_4 obj_06 obj_09 obj_04)
   goals met: 1 of 4
5. (op_3 obj_06 obj_03 obj_01 obj_13)
   deleted: (pred_2 obj_03 obj_01) (pred_3 obj_06 obj_13)
   added: (pred_4 obj_06 obj_03 obj_13)
   goals met: 1 of 4
6. (op_2 obj_07 obj_05 obj_02 obj_12)
   deleted: (pred_4 obj_07 obj_05 obj_12)
   added: (pred_2 obj_05 obj_02) (pred_3 obj_07 obj_12)
   goals met: 2 of 4
7. (op_1 obj_06 obj_01 obj_08)
   deleted: (pred_1 obj_06 obj_01)
   added: (pred_1 obj_06 obj_08)
   goals met: 2 of 4
8. (op_2 obj_06 obj_09 obj_08 obj_04)
   deleted: (pred_4 obj_06 obj_09 obj_04)
   added: (pred_2 obj_09 obj_08) (pred_3 obj_06 obj_04)
   goals met: 3 of 4
9. (op_1 obj_07 obj_02 obj_11)
   deleted: (pred_1 obj_07 obj_02)
   added: (pred_1 obj_07 obj_11)
   goals met: 3 of 4
10. (op_1 obj_06 obj_08 obj_02)
   deleted: (pred_1 obj_06 obj_08)
   added: (pred_1 obj_06 obj_02)
   goals met: 3 of 4
11. (op_2 obj_06 obj_03 obj_02 obj_13)
   deleted: (pred_4 obj_06 obj_03 obj_13)
   added: (pred_2 obj_03 obj_02) (pred_3 obj_06 obj_13)
   goals met: 4 of 4
